Необходимо скачать датасеты: [`titles.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKajNMa1pfSzN6Q3M) и [`cast.csv`](https://drive.google.com/open?id=0B3G70MlBnCgKal9UYTJSR2ZhSW8).

In [1]:
import pandas as pd

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

Сколько фильмов в таблице?

In [3]:
print('Уникальных названий в таблице:',titles['title'].nunique())
print('Общее количество фильмов в таблице:', titles.shape[0])

Уникальных названий в таблице: 197578
Общее количество фильмов в таблице: 215981

Какие два самых ранних фильма в таблице?

In [4]:
titles.sort_values(by = 'year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

У скольких фильмов название `Hamlet`?

In [5]:
titles[titles.title == 'Hamlet'].shape[0]

19

In [6]:
titles[titles.title == 'Hamlet'].sort_values(by = 'year')

         title  year
43511   Hamlet  1910
195015  Hamlet  1911
154627  Hamlet  1913
91710   Hamlet  1921
5562    Hamlet  1948
68239   Hamlet  1954
169996  Hamlet  1964
114224  Hamlet  1969
205821  Hamlet  1973
85741   Hamlet  1976
87781   Hamlet  1987
42224   Hamlet  1990
186988  Hamlet  1996
87971   Hamlet  2000
163645  Hamlet  2009
192815  Hamlet  2011
207793  Hamlet  2014
37373   Hamlet  2015
26160   Hamlet  2016

Выведите список всех фильмов `Treasure Island` с годами

In [7]:
titles[titles.title == 'Treasure Island']

                  title  year
47769   Treasure Island  1920
90175   Treasure Island  1950
103646  Treasure Island  1973
104714  Treasure Island  1972
166675  Treasure Island  1999
190792  Treasure Island  1985
191379  Treasure Island  1918
192917  Treasure Island  1934

Сколько фильмов было сделано с 1850 по 1900 года?

In [8]:
titles[(titles.year >= 1850) & (titles.year <= 1900)].shape[0]

8

In [9]:
titles[(titles.year >= 1850) & (titles.year <= 1900)]

                                                    title  year
12582                                Family Troubles (II)  1900
19157   Pierrot's Problem, or How to Make a Fat Wife O...  1900
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897
88362                            Trouble in Hogan's Alley  1900
115903     Reproduction of the Corbett and Jeffries Fight  1899
165182                                         Miss Jerry  1894
170496                              Soldiers of the Cross  1900
198354        Sharkey-McCoy Fight Reproduced in 10 Rounds  1899

In [10]:
cast = pd.read_csv('cast.csv')
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

У скольких ролей в фильме `Inception` неизвестно значение столбца `n`?

In [11]:
ins = cast[cast.title == 'Inception']

In [12]:
ins[ins.n.isnull()].shape[0]

22

А у скольких известно?

In [13]:
ins = cast[cast.title == 'Inception']

In [14]:
ins.shape[0] - ins[ins.n.isnull()].shape[0]

51

In [15]:
ins[ins.n.notnull()].shape[0]

51

Отобразите актеров фильма `North by Northwest` по их "главности", то есть отсортируйте по значению столбца `n`. Неизвестные значиния игнорировать.

In [16]:
nbn = cast[cast.title == 'North by Northwest']

In [17]:
nbn.sort_values(by = 'n', ascending = True).name

778278              Cary Grant
3104905        Eva Marie Saint
1300582            James Mason
2794420    Jessie Royce Landis
317310          Leo G. Carroll
                  ...
3038704        Maudie Prickett
3154878            Doris Singh
3174006           Helen Spring
3293738          Susan Whitney
3304335         Paula Winslowe
Name: name, Length: 110, dtype: object

Сколько ролей было в немой версии Гамлета 1921 года?

In [18]:
hamlet = cast[(cast.title == 'Hamlet') & (cast.year == 1921)]

In [19]:
hamlet.character.nunique()

9

Перечислите вторые роли Брэда Питта по годам

In [20]:
bp = cast[cast.name == 'Brad Pitt']

In [22]:
bp[bp.n == 2].sort_values(by = 'year')

,title,year,name,type,character,n
1614656,The Dark Side of the Sun,1988,Brad Pitt,actor,Rick,2.0
1614615,Across the Tracks,1990,Brad Pitt,actor,Joe Maloney,2.0
1614613,A River Runs Through It,1992,Brad Pitt,actor,Paul Maclean,2.0
1614657,The Devil's Own,1997,Brad Pitt,actor,Rory Devaney,2.0
1614658,The Devil's Own,1997,Brad Pitt,actor,Francis Austin McGuire,2.0
1614623,Fight Club,1999,Brad Pitt,actor,Tyler Durden,2.0
1614651,Spy Game,2001,Brad Pitt,actor,Tom Bishop,2.0
1614644,Ocean's Thirteen,2007,Brad Pitt,actor,Rusty Ryan,2.0
1614639,Megamind,2010,Brad Pitt,actor,Metro Man,2.0